УТ_для_edt/src/InformationRegisters/смартДЛ_ЛогЗапросов/смартДЛ_ЛогЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДЛ_ЛогЗапросов</name>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Получено</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазваниеМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартДЛ_Сессии/смартДЛ_Сессии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДЛ_Сессии</name>
  <comment>Хранение sessionID API Деловых Линий</comment>
  <resources>
    <name>ИдентификаторСессии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартДЛ_ХешиСправочников/смартДЛ_ХешиСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДЛ_ХешиСправочников</name>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартДЛ_Шаблоны/смартДЛ_Шаблоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДЛ_Шаблоны</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИспользования</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартДЛ_АдреснаяКнига/смартДЛ_АдреснаяКнига.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДЛ_АдреснаяКнига</name>
  <attributes>
    <name>ДатаИспользования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселнныйПункт</name>
    <type>
      <types>CatalogRef.смартДЛ_Города</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчастникГрузоперевозки</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/смартДЛ_Города/смартДЛ_Города.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартДЛ_Города</name>
  <attributes>
    <name>КодКЛАДР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДгорода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартДеловыеЛинии/Module.bsl
Функция ВыполнитьPOSTЗапрос(АдресМетода, СтруктураПараметров) Экспорт
	
	ЛогированиеВключено = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_ДнейХраненияЛогов") > 0; 
	СериализованныеПараметры = СериализоватьСтруктуруПараметров(СтруктураПараметров); 
	 
	ПараметрыПодключения = ПолучитьПараметрыПодключения(); 
	
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер,,,, НовыйИнтернетПрокси(ПараметрыПодключения.Прокси), ПараметрыПодключения.Таймаут, Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json; charset=utf-8");	
	
	Запрос = Новый HTTPЗапрос(АдресМетода, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СериализованныеПараметры, "UTF-8"); 
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Ответ  = Соединение.ОтправитьДляОбработки(Запрос); 
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КодСтатуса", Ответ.КодСостояния);
	СтруктураДанных.Вставить("Тело",       Ответ.ПолучитьТелоКакСтроку()); 
	
	Если ЛогированиеВключено Тогда   
		
		ЛогироватьЗапрос(АдресМетода, СтруктураПараметров, СтруктураДанных.Тело, ВремяОкончания - ВремяНачала);
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции 

Процедура ЛогироватьЗапрос(Метод, Знач Отправлено, Получено, ВремяВыполнения)
	
	ЗаписьПолучено = ?(Метод = "v2/mutual_calculations.json", "***", Получено);
	
	Если Отправлено.Свойство("password") Тогда
		
		Отправлено["password"] = "***";	
		
	КонецЕсли;
	
	Если Метод = "v3/auth/login.json" Тогда
		
		Если Отправлено.Свойство("appKey") Тогда
			
			Отправлено["appKey"] = "***";
			
		КонецЕсли;
		
		Если Отправлено.Свойство("login") Тогда
			
			Отправлено["login"] = "***";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отправлено.Свойство("sessionID") Тогда
		
		Отправлено["sessionID"] = "***";	
		
	КонецЕсли; 
	
	Если Метод = "v3/auth/login.json" Тогда
		
		Если СтрНайти(Получено, "sessionID") > 0  Тогда
			
			ЗаписьПолучено = "Успешно";	
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЛогЗапросов = РегистрыСведений.смартДЛ_ЛогЗапросов.СоздатьМенеджерЗаписи();
	ЛогЗапросов.Метод = Метод;
	ЛогЗапросов.Дата = ТекущаяДатаСеанса();
	ЛогЗапросов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЛогЗапросов.Отправлено = СериализоватьСтруктуруПараметров(Отправлено);
	ЛогЗапросов.Получено = ЗаписьПолучено;
	ЛогЗапросов.ВремяВыполнения = ВремяВыполнения; 
	ЛогЗапросов.НазваниеМетода = ПолучитьНазваниеМетода(Метод);
	ЛогЗапросов.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьПараметрыТекцущейВерсии() 		
	
	Возврат смартДеловыеЛинииПовтИсп.ПолучитьПараметрыТекцущейВерсии();
	
КонецФункции

Функция ПолучитьНазваниеМетода(Метод)
	
	НазванияМетодов = смартДеловыеЛинииПовтИсп.НазванияМетодов();
	
	Возврат НазванияМетодов.Получить(Метод); 
	
КонецФункции

Функция ДЛ_ПолучитьФайл(АдресФайла)
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения();   
	
	Адрес = СтрЗаменить(АдресФайла, ПараметрыПодключения.Сервер + "/", Символы.ПС);
	Адрес = СтрПолучитьСтроку(Адрес, СтрЧислоСтрок(Адрес));
	
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер,,,, НовыйИнтернетПрокси(ПараметрыПодключения.Прокси), ПараметрыПодключения.Таймаут, Новый ЗащищенноеСоединениеOpenSSL());
	Запрос     = Новый HTTPЗапрос(Адрес);
	
	Ответ      = Соединение.Получить(Запрос);	
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КодСтатуса", Ответ.КодСостояния);
	СтруктураДанных.Вставить("Файл", Ответ.ПолучитьТелоКакДвоичныеДанные()); 	
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьПараметрыПодключения() Экспорт 	
	
	Результат = Новый Структура;
	
	Таймаут = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_Таймаут");
	
	Результат.Вставить("Прокси", смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_ПроксиСервер"));
	Результат.Вставить("Таймаут", ?(Таймаут = 0, 45, Таймаут)); 
	Результат.Вставить("Сервер", смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_Сервер"));
	
	Возврат Результат;                         
	
КонецФункции 

Функция НовыйИнтернетПрокси(ПараметрыПроксиСервера) Экспорт
	
	Прокси = Новый ИнтернетПрокси;
	
	Если ЗначениеЗаполнено(ПараметрыПроксиСервера) Тогда
		
		СтруктураПараметров = СтруктураИнтернетАдреса(ПараметрыПроксиСервера);
		
		Прокси.Установить("https", СтруктураПараметров.Хост, СтруктураПараметров.Порт, СтруктураПараметров.Логин, СтруктураПараметров.Пароль);
		Прокси.Установить("http", СтруктураПараметров.Хост, СтруктураПараметров.Порт, СтруктураПараметров.Логин, СтруктураПараметров.Пароль);		
		
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции  

Функция КлючХраненияСессииДЛ()
	
	Возврат "Основная";
	
КонецФункции

Функция ПрочитатьСессиюИзРегистра()
	
	Результат = Новый Структура("ИдентификаторСессии, ДействуетДо", "", '00010101');
	
	ЗаписьСессии = РегистрыСведений.смартДЛ_Сессии.СоздатьМенеджерЗаписи();
	ЗаписьСессии.Ключ = КлючХраненияСессииДЛ();
	ЗаписьСессии.Прочитать();
	
	Если ЗаписьСессии.Выбран() Тогда
		
		Результат.ИдентификаторСессии = ЗаписьСессии.ИдентификаторСессии;
		Результат.ДействуетДо = ЗаписьСессии.ДействуетДо;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСессиюВРегистр(ИдентификаторСессии, ДействуетДо)
	
	ЗаписьСессии = РегистрыСведений.смартДЛ_Сессии.СоздатьМенеджерЗаписи();
	ЗаписьСессии.Ключ = КлючХраненияСессииДЛ();
	ЗаписьСессии.ИдентификаторСессии = ИдентификаторСессии;
	ЗаписьСессии.ДействуетДо = ДействуетДо;
	ЗаписьСессии.Записать();
	
КонецПроцедуры

Процедура ОчиститьСессиюВРегистре()
	
	ЗаписьСессии = РегистрыСведений.смартДЛ_Сессии.СоздатьМенеджерЗаписи();
	ЗаписьСессии.Ключ = КлючХраненияСессииДЛ();
	ЗаписьСессии.Удалить();
	
КонецПроцедуры

Процедура УстановитьСессиюВПараметрыСеанса(ИдентификаторСессии, ДействуетДо)
	
	УстановитьПараметрСеанса("смартДЛ_ИДСессии", ИдентификаторСессии);
	УстановитьПараметрСеанса("смартДЛ_СрокДействияСессии", ДействуетДо);
	
КонецПроцедуры

Процедура СброситьИдентификаторСессии() Экспорт
	
	ОчиститьСессиюВРегистре();
	УстановитьСессиюВПараметрыСеанса("", '00010101');
	
КонецПроцедуры

Функция ОтветАвторизацииДЛУспешен(РезультатЗапроса, СтруктураОтвета = Неопределено)
	
	Если РезультатЗапроса.КодСтатуса <> 200 Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СтруктураОтвета = Неопределено И ЗначениеЗаполнено(РезультатЗапроса.Тело) Тогда
		
		СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
		
	КонецЕсли;
	
	Если СтруктураОтвета = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Метаданные = СтруктураОтвета.Получить("metadata");
	
	Если Метаданные = Неопределено Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	СтатусAPI = Метаданные.Получить("status");
	
	Если СтатусAPI <> Неопределено И СтатусAPI <> 200 Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаписатьОшибкуАвторизацииДЛ(РезультатЗапроса, ТекстОшибки = "")
	
	КодHTTP = РезультатЗапроса.КодСтатуса;
	СтатусAPI = "?";
	СообщениеAPI = ТекстОшибки;
	
	Если ПустаяСтрока(СообщениеAPI) И ЗначениеЗаполнено(РезультатЗапроса.Тело) Тогда
		
		Попытка
			
			СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
			Метаданные = СтруктураОтвета.Получить("metadata");
			
			Если Метаданные <> Неопределено Тогда
				
				СтатусОтвета = Метаданные.Получить("status");
				
				Если СтатусОтвета <> Неопределено Тогда
					
					СтатусAPI = Формат(СтатусОтвета, "ЧГ=0");
					
				КонецЕсли;
				
				СообщениеAPI = Метаданные.Получить("detail");
				
				Если СообщениеAPI = Неопределено Тогда
					
					СообщениеAPI = Метаданные.Получить("message");
					
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			
			СообщениеAPI = "";
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если СообщениеAPI = Неопределено Тогда
		
		СообщениеAPI = "";
		
	КонецЕсли;
	
	Комментарий = СтрШаблон(
		НСтр("ru = 'HTTP %1, статус API %2. %3'"),
		КодHTTP,
		СтатусAPI,
		СообщениеAPI);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Деловые линии.Авторизация'"),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		Комментарий);
	
КонецПроцедуры

Функция ТекстИсключенияАвторизацииДЛ(РезультатЗапроса)
	
	ТекстОшибки = "";
	
	Если ЗначениеЗаполнено(РезультатЗапроса.Тело) Тогда
		
		Попытка
			
			СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
			Метаданные = СтруктураОтвета.Получить("metadata");
			
			Если Метаданные <> Неопределено Тогда
				
				ТекстОшибки = Метаданные.Получить("detail");
				
				Если ТекстОшибки = Неопределено Тогда
					
					ТекстОшибки = Метаданные.Получить("message");
					
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = "";
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ТекстОшибки = НСтр("ru = 'Не удалось авторизоваться в API Деловых Линий.'");
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция SessionID() Экспорт 
	
	Сейчас = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.смартДЛ_ИДСессии)
		И Сейчас < ПараметрыСеанса.смартДЛ_СрокДействияСессии Тогда
		
		Возврат ПараметрыСеанса.смартДЛ_ИДСессии;
		
	КонецЕсли;
	
	ДанныеСессии = ПрочитатьСессиюИзРегистра();
	
	Если ЗначениеЗаполнено(ДанныеСессии.ИдентификаторСессии)
		И Сейчас < ДанныеСессии.ДействуетДо Тогда
		
		УстановитьСессиюВПараметрыСеанса(ДанныеСессии.ИдентификаторСессии, ДанныеСессии.ДействуетДо);
		Возврат ДанныеСессии.ИдентификаторСессии;
		
	КонецЕсли;
	
	Результат = ПолучитьИДСессии();
	
	ПроверитьНеобходимостьОбновленияСправочников();
	ФоновыеЗадания.Выполнить("смартДеловыеЛинии.ПодрезатьРегистрЛогов");
	ФоновыеЗадания.Выполнить("смартДеловыеЛинии.ПодрезатьРегистрАдреснойКниги");
	
	Возврат Результат;
	
КонецФункции    

Функция СериализоватьСтруктуруПараметров(СтруктураПараметров) Экспорт 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, ""));
	ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции    

Функция ДесериализоватьСтруктуруПараметров(Тело, ЭтоДвоичныеДанные = Ложь) Экспорт 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	
	Если ЭтоДвоичныеДанные Тогда
		
		ЧтениеJSON.ОткрытьПоток(Тело.ОткрытьПотокДляЧтения());
		
	Иначе
		
		ЧтениеJSON.УстановитьСтроку(Тело);
		
	КонецЕсли;	
	
	Возврат ПрочитатьJSON(ЧтениеJSON, Истина);
	
КонецФункции

Функция СтруктураИнтернетАдреса(Знач ИнтернетАдрес)
	
	ИнтернетАдрес        = СокрЛП(ИнтернетАдрес);
	ПараметрыАвторизации = "";
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Протокол",     "");
	СтруктураДанных.Вставить("ИмяСервера",   "");
	СтруктураДанных.Вставить("Хост",         "");
	СтруктураДанных.Вставить("Порт", 	     "");
	СтруктураДанных.Вставить("Логин",        "");
	СтруктураДанных.Вставить("Пароль",       "");
	СтруктураДанных.Вставить("АдресРесурса", "");
	
	РазложитьСтрокуПоРазделителю(ИнтернетАдрес, "://", "Второе", СтруктураДанных.Протокол, ИнтернетАдрес);                // выделяем протокол из адреса
	РазложитьСтрокуПоРазделителю(ИнтернетАдрес, "/",   "Первое", ИнтернетАдрес, СтруктураДанных.АдресРесурса);            // выделяем адрес ресурса на сервере
	РазложитьСтрокуПоРазделителю(ИнтернетАдрес, "@",   "Второе", ПараметрыАвторизации, СтруктураДанных.ИмяСервера);       // выделяем имя сервера и параметры авторизации
	РазложитьСтрокуПоРазделителю(ПараметрыАвторизации, ":", "Первое",  СтруктураДанных.Логин, СтруктураДанных.Пароль);    // раскладываем параметры авторизации на поля
	РазложитьСтрокуПоРазделителю(СтруктураДанных.ИмяСервера, ":", "Первое", СтруктураДанных.Хост, СтруктураДанных.Порт);  // раскладываем имя сервера на поля
	
	Если ЗначениеЗаполнено(СтруктураДанных.Порт) Тогда
		
		СтруктураДанных.Порт = Число(СтруктураДанных.Порт);
		
	Иначе
		
		СтруктураДанных.Порт = Неопределено;
		
	КонецЕсли; 
	
	Возврат СтруктураДанных;
	
КонецФункции  

Процедура РазложитьСтрокуПоРазделителю(Знач ИсходнаяСтрока, Разделитель, ЗаполнятьБезРазделителя = "", ПервоеПоле, ВтороеПоле)
	
	СмещениеВПраво     = СтрДлина(Разделитель);
	ПозицияРазделителя = СтрНайти(ИсходнаяСтрока, Разделитель);
	
	Если ПозицияРазделителя > 0 Тогда
		
		ПервоеПоле = Лев(ИсходнаяСтрока,  ПозицияРазделителя - 1);
		ВтороеПоле = Сред(ИсходнаяСтрока, ПозицияРазделителя + СмещениеВПраво);
		
	ИначеЕсли ЗаполнятьБезРазделителя = "Первое" Тогда
		
		ПервоеПоле = ИсходнаяСтрока;
		
	ИначеЕсли ЗаполнятьБезРазделителя = "Второе" Тогда
		
		ВтороеПоле = ИсходнаяСтрока;
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьИДСессии() Экспорт
	
	СтруктураПараметров = СтруктураЗапросаПоКлючуПриложения();
	СтруктураПараметров.Вставить("login", смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_Логин"));
	СтруктураПараметров.Вставить("password", смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_Пароль"));
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("Авторизация"), СтруктураПараметров);
	СтруктураОтвета = Неопределено;
	
	Если ЗначениеЗаполнено(РезультатЗапроса.Тело) Тогда
		
		СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
		
	КонецЕсли;
	
	Если Не ОтветАвторизацииДЛУспешен(РезультатЗапроса, СтруктураОтвета) Тогда
		
		ЗаписатьОшибкуАвторизацииДЛ(РезультатЗапроса);
		ВызватьИсключение ТекстИсключенияАвторизацииДЛ(РезультатЗапроса);
		
	КонецЕсли;
	
	ИдентификаторСессии = "";
	ДанныеОтвета = СтруктураОтвета.Получить("data");
	
	Если ДанныеОтвета <> Неопределено Тогда
		
		ИдентификаторСессии = ДанныеОтвета.Получить("sessionID");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		
		ЗаписатьОшибкуАвторизацииДЛ(РезультатЗапроса, НСтр("ru = 'В ответе авторизации отсутствует sessionID.'"));
		ВызватьИсключение НСтр("ru = 'В ответе авторизации API Деловых Линий отсутствует идентификатор сессии.'");
		
	КонецЕсли;
	
	СтруктураПараметров = СтруктураЗапросаПоКлючуПриложения();
	СтруктураПараметров.Вставить("sessionID", ИдентификаторСессии);
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ИнформацияОСессии"), СтруктураПараметров);
	СтруктураОтветаИнфо = Неопределено;
	
	Если ЗначениеЗаполнено(РезультатЗапроса.Тело) Тогда
		
		СтруктураОтветаИнфо = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
		
	КонецЕсли;
	
	Если ОтветАвторизацииДЛУспешен(РезультатЗапроса, СтруктураОтветаИнфо) Тогда
		
		ДанныеСессии = СтруктураОтветаИнфо.Получить("data");
		
		Если ДанныеСессии <> Неопределено Тогда
			
			Сессия = ДанныеСессии.Получить("session");
			
			Если Сессия <> Неопределено Тогда
				
				СрокДействияСтрокой = Сессия.Получить("expireTime");
				
				Если ЗначениеЗаполнено(СрокДействияСтрокой) Тогда
					
					СрокДействия = ПреобразоватьВДату(СрокДействияСтрокой);
					
				Иначе
					
					СрокДействия = ТекущаяДатаСеанса() + 24 * 60 * 60;
					
				КонецЕсли;
				
			Иначе
				
				СрокДействия = ТекущаяДатаСеанса() + 24 * 60 * 60;
				
			КонецЕсли;
			
		Иначе
			
			СрокДействия = ТекущаяДатаСеанса() + 24 * 60 * 60;
			
		КонецЕсли;
		
	Иначе
		
		СрокДействия = ТекущаяДатаСеанса() + 24 * 60 * 60;
		
	КонецЕсли;
	
	УстановитьСессиюВПараметрыСеанса(ИдентификаторСессии, СрокДействия);
	ЗаписатьСессиюВРегистр(ИдентификаторСессии, СрокДействия);
	
	Возврат ИдентификаторСессии;
	
КонецФункции

Функция ПреобразоватьВДату(Знач ДатаСтрокой) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСтрокой) Тогда
		
		Возврат Дата("00010101");
		
	КонецЕсли;
	
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "-", "");			
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, " ", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "T", "");
	
	Возврат Дата(ДатаСтрокой);
	
КонецФункции

Функция AppKey() Экспорт
	
	Возврат смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_appkey");
	
КонецФункции 

Процедура ВывестиСообщениеПользователю(Текст, Поле = Неопределено, Интерактивно = Истина, ПараметрОтказ = Неопределено) Экспорт
	
	Если Интерактивно Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СокрЛП(Текст);
		
		Если ЗначениеЗаполнено(Поле) Тогда
			
			Сообщение.Поле = Поле;
			
		КонецЕсли;
		
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	ПараметрОтказ = Истина;
	
КонецПроцедуры

Процедура УстановитьПараметрСеанса(Имя, Значение) Экспорт
	
	ПараметрыСеанса[Имя] = Значение;	
	
КонецПроцедуры  

Функция АдресМетода(ИмяМетода) Экспорт
	
	СтруктураАдресовМетодов = смартДеловыеЛинииПовтИсп.АдресаМетодов();
	
	Возврат СтруктураАдресовМетодов[ИмяМетода];
	
КонецФункции  

Процедура ПроверитьНеобходимостьОбновленияСправочников()
	
	СправочникиСТипомЗагрузки = ПолучитьСтруктуруЗагружаемыхСправочниктов();
	
	Для Каждого Справочник Из СправочникиСТипомЗагрузки Цикл		
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("appkey", AppKey()); 
		
		Если Справочник.Ключ = "ДЛ_Контрагенты" Тогда
			
			СтруктураПараметров.Вставить("sessionID", ПараметрыСеанса.смартДЛ_ИДСессии); 
			
		КонецЕсли;			
		
		РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("Справочник." + Справочник.Ключ), СтруктураПараметров);
		
		Если РезультатЗапроса.КодСтатуса = 200 Тогда
			
			СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);		
			
			Хеш = ?(Справочник.Значение = "json", Строка(НачалоДня(ТекущаяДата())), СтруктураОтвета["hash"]);
			ТекущийХеш = РегистрыСведений.смартДЛ_ХешиСправочников.ПолучитьХеш(Справочник.Ключ);
			
			Если Хеш <> ТекущийХеш Тогда 
				
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(Справочник);
				МассивПараметров.Добавить(СтруктураОтвета);
				
				ИмяФункции = ?(Справочник.Значение = "json", "ОбновитьЗначенияСправочникаИзJSON", "ОбновитьСправочник");
			
				ФоновыеЗадания.Выполнить("смартДеловыеЛинии." + ИмяФункции, МассивПараметров);	
				//Выполнить(ИмяФункции + "(Справочник, СтруктураОтвета);");
				
			КонецЕсли; 	
			
		Иначе
			
			//Обработка ошибок
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруЗагружаемыхСправочниктов()
	
	Результат = Новый Структура;	                
	Результат.Вставить("смартДЛ_Города", "csv");
	Результат.Вставить("ДЛ_Контрагенты", "json");		
	Результат.Вставить("смартДЛ_ХарактерГруза", "csv");
	Результат.Вставить("смартДЛ_ДополнительныеУслуги", "csv");
	Результат.Вставить("смартДЛ_ДокументыДляПолучения", "csv");    
	Результат.Вставить("смартДЛ_ПараметрыДляОтчета", "csv");   
	Результат.Вставить("смартДЛ_ВидыЗагрузки", "json");
	Результат.Вставить("смартДЛ_СпециальныеТребования", "json"); 
	Результат.Вставить("смартДЛ_ВидыУпаковок", "json");
	Результат.Вставить("смартДЛ_СтатусыЗаказа", "json");	  
	Результат.Вставить("СтраныМира", "json"); 
	Результат.Вставить("смартДЛ_ОПФ", "json");
	Результат.Вставить("смартДЛ_ПараметрыНГГ", "json"); 
	Результат.Вставить("ДЛ_Терминалы_Города", "json_file");
	
	Возврат Результат; 	
	
КонецФункции 

Процедура ОбновитьЗначенияСправочникаИзJSON(СправочникСТипомЗагрузки, СтруктураПараметров, СвязьСВышестоящим = Неопределено) Экспорт	 
	
	ИмяСправочника = ?(СправочникСТипомЗагрузки.Ключ = "ДЛ_Терминалы_Города", "смартДЛ_Города", СправочникСТипомЗагрузки.Ключ);
	ИмяСправочника = ?(СправочникСТипомЗагрузки.Ключ = "ДЛ_Контрагенты", "Контрагенты", СправочникСТипомЗагрузки.Ключ);
	
	МассивПоляПоиска = Справочники[ИмяСправочника].ПолучитьМассивПоляПоиска(); 
	ТаблицаПолейЗначений = Справочники[ИмяСправочника].ПолучитьТаблицуПолейЗначений();  
	
	Если ИмяСправочника = "Контрагенты" Тогда
		
		КоллекцияПараметров = СтруктураПараметров["data"]["counteragents"]; 
		
	Иначе
		
	    КоллекцияПараметров = СтруктураПараметров["data"];    
		
	КонецЕсли;
	
	Для Каждого СтруктураДанных Из КоллекцияПараметров Цикл		 
		
		ЭлементВБазе = Справочники[ИмяСправочника].НайтиПоРеквизиту(МассивПоляПоиска[1], СтруктураДанных[МассивПоляПоиска[0]]);		
		
		Если ЗначениеЗаполнено(ЭлементВБазе) Тогда 
			
			ТребуетсяОбновитьЭлемент = Ложь;
			
			Для Каждого ПолеЗначения Из ТаблицаПолейЗначений Цикл
				
				Если ПолеЗначения.ТипСопоставления = "Реквизит" Тогда	
					
					Если ЭлементВБазе[ПолеЗначения.ИмяРеквизита] = СтруктураДанных[ПолеЗначения.Поле] Тогда 
						
						ТребуетсяОбновитьЭлемент = Истина;						
						Прервать;
						
					КонецЕсли;  
					
				ИначеЕсли ПолеЗначения.ТипСопоставления = "ТабличнаяЧасть" Или ПолеЗначения.ТипСопоставления = "Справочник" Тогда  
					
					//Подумать о доработке сравнения наборов данных в табличных частях. Пока на всякий пожарный перегружаем каждый раз.	
					ТребуетсяОбновитьЭлемент = Истина;						
					Прервать; 					
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТребуетсяОбновитьЭлемент Тогда
				
				ОбъектВБазе = ЭлементВБазе.ПолучитьОбъект(); 
				
				Если СвязьСВышестоящим <> Неопределено Тогда
					
					ОбъектВБазе[СвязьСВышестоящим[0]] = СвязьСВышестоящим[1];
					
				КонецЕсли;
				
				ДозаполнитьОбъектРеквизитамиJSON(ОбъектВБазе, СтруктураДанных, ТаблицаПолейЗначений); 				
				
			КонецЕсли;
			
		Иначе
			
			НовыйЭлемент = Справочники[ИмяСправочника].СоздатьЭлемент();
			НовыйЭлемент[МассивПоляПоиска[1]] = СтруктураДанных[МассивПоляПоиска[0]];	
			
			Если СвязьСВышестоящим <> Неопределено Тогда
					
				НовыйЭлемент[СвязьСВышестоящим[0]] = СвязьСВышестоящим[1];
					
			КонецЕсли;
			
			ДозаполнитьОбъектРеквизитамиJSON(НовыйЭлемент, СтруктураДанных, ТаблицаПолейЗначений); 			
			
		КонецЕсли;
		
	КонецЦикла;  
	
	ЗаписьХеша = РегистрыСведений.смартДЛ_ХешиСправочников.СоздатьМенеджерЗаписи();
	ЗаписьХеша.ИмяСправочника = СправочникСТипомЗагрузки.Ключ;
	ЗаписьХеша.Хеш = Строка(НачалоДня(ТекущаяДата()));
	ЗаписьХеша.Записать(Истина);
	
КонецПроцедуры

Процедура ДозаполнитьОбъектРеквизитамиJSON(ОбъектСправочника, СтруктураДанных, ТаблицаПолейЗначений)
	
	Для Каждого ПолеЗначения Из ТаблицаПолейЗначений Цикл 
		
		Если ПолеЗначения.ТипСопоставления = "Реквизит" Тогда
			
			ОбъектСправочника[ПолеЗначения.ИмяРеквизита] = СтруктураДанных[ПолеЗначения.Поле];	
			
		ИначеЕсли ПолеЗначения.ТипСопоставления = "ТабличнаяЧасть" Тогда
			
			ОбъектСправочника[ПолеЗначения.ИмяРеквизита].Очистить();	
			
			Для Каждого СтрокаДанных Из СтруктураДанных[ПолеЗначения.Поле] Цикл
				
				СтрокаТабличнойЧасти = ОбъектСправочника[ПолеЗначения.ИмяРеквизита].Добавить();
				
				Для Каждого ПолеСтруктурыСтроки Из ПолеЗначения.Дополнительно Цикл
					
					Если ПолеСтруктурыСтроки.Значение = Неопределено Тогда
						
						СтрокаТабличнойЧасти[ПолеСтруктурыСтроки.Ключ] = СтрокаДанных;
						
					Иначе
						
						СтрокаТабличнойЧасти[ПолеСтруктурыСтроки.Ключ] = СтрокаДанных[ПолеСтруктурыСтроки.Значение];	
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		ИначеЕсли ПолеЗначения.ТипСопоставления = "Справочник" Тогда
			
			Если ЗначениеЗаполнено(ПолеЗначения.ИмяРеквизита) Тогда 
				
				СтруктураДанныхНовогоСправочника = СтруктураДанных[ПолеЗначения.Поле][ПолеЗначения.ИмяРеквизита];
				
			Иначе    
				
				СтруктураДанныхНовогоСправочника = СтруктураДанных[ПолеЗначения.Поле];
				
			КонецЕсли;  
			
			СправочникиСТипомЗагрузки = Новый Структура(ПолеЗначения.Дополнительно);
			
			Если ЗначениеЗаполнено(ОбъектСправочника.Ссылка) Тогда
				
				СсылкаНаОбъект = ОбъектСправочника.Ссылка;
				
			Иначе 
				
				СсылкаНаОбъект = Справочники[ОбъектСправочника.Метаданные().Имя].ПолучитьСсылку();				
				ОбъектСправочника.УстановитьСсылкуНового(СсылкаНаОбъект);	
				
			КонецЕсли;  
			
			Для Каждого СправочникСТипомЗагрузки Из СправочникиСТипомЗагрузки Цикл
			
				ОбновитьЗначенияСправочникаИзJSON(СправочникСТипомЗагрузки, Новый Структура("data", СтруктураДанныхНовогоСправочника), МассивДвухЭлементов("Город", СсылкаНаОбъект));
				
			КонецЦикла;	
			
		ИначеЕсли ПолеЗначения.ТипСопоставления = "ВложенныеРеквизиты" Тогда
			
			Для Каждого ВложенныйРеквизит Из ПолеЗначения.Дополнительно Цикл
				
				Если ТипЗнч(ВложенныйРеквизит.Значение) = Тип("Массив") Тогда
					
					Если ВложенныйРеквизит.Значение[0] = "ТабличнаяЧасть" Тогда
						
						ОбъектСправочника[ВложенныйРеквизит.Значение[1]].Очистить();
						
						Для Каждого СтрокаДанных Из СтруктураДанных[ПолеЗначения.Поле][ВложенныйРеквизит.Ключ] Цикл
							
							СтрокаТабличнойЧасти = ОбъектСправочника[ВложенныйРеквизит.Значение[1]].Добавить();
							
							Для Каждого ПолеСтруктурыСтроки Из ВложенныйРеквизит.Значение[2] Цикл
								
								Если ПолеСтруктурыСтроки.Значение = Неопределено Тогда
									
									СтрокаТабличнойЧасти[ПолеСтруктурыСтроки.Ключ] = СтрокаДанных;
									
								Иначе
									
									СтрокаТабличнойЧасти[ПолеСтруктурыСтроки.Ключ] = СтрокаДанных[ПолеСтруктурыСтроки.Значение];	
									
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЦикла;
						
					КонецЕсли;					
					
				Иначе
					
					Если ТипЗнч(СтруктураДанных[ПолеЗначения.Поле]) = Тип("Соответствие") Тогда
					
						ОбъектСправочника[ВложенныйРеквизит.Значение] = СтруктураДанных[ПолеЗначения.Поле][ВложенныйРеквизит.Ключ];						
						
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЦикла;			
			
		КонецЕсли;
		
	КонецЦикла;			
	
	ОбъектСправочника.Записать();	
	
КонецПроцедуры

Процедура ОбновитьСправочник(СправочникСТипомЗагрузки, СтруктураПараметров) Экспорт  
	
	РезультатЗапроса = ДЛ_ПолучитьФайл(СтруктураПараметров["url"]);
	
	Если РезультатЗапроса.КодСтатуса = 200 Тогда							
		
		Если СправочникСТипомЗагрузки.Значение = "csv" Тогда
			
			ОбновитьЗначенияСправочникаИзCSV(СправочникСТипомЗагрузки.Ключ, РезультатЗапроса.Файл);			 
			
		ИначеЕсли СправочникСТипомЗагрузки.Значение = "json_file" Тогда
			
			ОбновитьЗначенияСправочникаИзФайлаJSON(СправочникСТипомЗагрузки, РезультатЗапроса.Файл);
			
		КонецЕсли;
		
		ЗаписьХеша = РегистрыСведений.смартДЛ_ХешиСправочников.СоздатьМенеджерЗаписи();
		ЗаписьХеша.ИмяСправочника = СправочникСТипомЗагрузки.Ключ;
		ЗаписьХеша.Хеш = СтруктураПараметров["hash"];
		ЗаписьХеша.Записать(Истина);
		
	КонецЕсли;		
	
КонецПроцедуры 

Процедура ОбновитьЗначенияСправочникаИзФайлаJSON(СправочникСТипомЗагрузки, ДвоичныеДанные)	 
	
	СтруктураДанных = ДесериализоватьСтруктуруПараметров(ДвоичныеДанные, Истина); 
	
	Для Каждого МассивДанных Из СтруктураДанных Цикл
	
		ОбновитьЗначенияСправочникаИзJSON(СправочникСТипомЗагрузки, Новый Структура("data", МассивДанных.Значение));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЗначенияСправочникаИзCSV(ИмяСправочника, ДвоичныеДанные) Экспорт 
	
	ОчищатьОтсутсвующиеВЗагрузке = Ложь;
	
	Если ИмяСправочника = "смартДЛ_Города" Тогда
		
		ГородаУдалитьДублиИПустыеКЛАДР();
		
	ИначеЕсли ИмяСправочника = "смартДЛ_ХарактерГруза" Тогда	 
		
		ОчищатьОтсутсвующиеВЗагрузке = Истина; 
		
		МассивЗагруженыхИД = Новый Массив;
		
	КонецЕсли;
	
	ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанные, "UTF-8");
	
	СтрокаЗаголовков = СтрЗаменить(ЧтениеДанных.ПрочитатьСтроку(), """", "");
	СтрокаДанных = ЧтениеДанных.ПрочитатьСтроку();    
	
	МассивПоляПоиска = Справочники[ИмяСправочника].ПолучитьМассивПоляПоиска(); 
	СтруктураПолейЗначений = Справочники[ИмяСправочника].ПолучитьСтруктуруПолейЗначений();  	
	
	Пока Не ЧтениеДанных.ЧтениеЗавершено Цикл		
		
		СтруктураДанных = Вычислить("Новый Структура(СтрокаЗаголовков, " + СтрокаДанных + ")");  
		
		Если ОчищатьОтсутсвующиеВЗагрузке Тогда
			
			МассивЗагруженыхИД.Добавить(СтруктураДанных[МассивПоляПоиска[0]]);				
			
		КонецЕсли;
		
		ЭлементВБазе = Справочники[ИмяСправочника].НайтиПоРеквизиту(МассивПоляПоиска[1], СтруктураДанных[МассивПоляПоиска[0]]);
		
		Если ЗначениеЗаполнено(ЭлементВБазе) Тогда 
			
			ТребуетсяОбновитьЭлемент = Ложь;
			
			Для Каждого ПолеЗначения Из СтруктураПолейЗначений Цикл
				
				Если ЭлементВБазе[ПолеЗначения.Значение] <> СтруктураДанных[ПолеЗначения.Ключ] Тогда 
					
					ТребуетсяОбновитьЭлемент = Истина;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТребуетсяОбновитьЭлемент Тогда
				
				ОбъектВБазе = ЭлементВБазе.ПолучитьОбъект(); 			
				ДозаполнитьОбъектРеквизитамиCSV(ОбъектВБазе, СтруктураДанных, СтруктураПолейЗначений);					
				
			КонецЕсли;
			
		Иначе
			
			НовыйЭлемент = Справочники[ИмяСправочника].СоздатьЭлемент();
			НовыйЭлемент[МассивПоляПоиска[1]] = СтруктураДанных[МассивПоляПоиска[0]];			
			ДозаполнитьОбъектРеквизитамиCSV(НовыйЭлемент, СтруктураДанных, СтруктураПолейЗначений);
			
		КонецЕсли;
		
		СтрокаДанных = ЧтениеДанных.ПрочитатьСтроку();
		
	КонецЦикла;	 
	
	Если ОчищатьОтсутсвующиеВЗагрузке Тогда
		
		ОчиститьОтсутсвующиеВЗагрузкеЭлементы(ИмяСправочника, МассивПоляПоиска[1], МассивЗагруженыхИД);
		
	КонецЕсли; 
	
КонецПроцедуры  

Процедура ДозаполнитьОбъектРеквизитамиCSV(ОбъектСправочника, СтруктураДанных, СтруктураПолейЗначений)
	
	Для Каждого ПолеЗначения Из СтруктураПолейЗначений Цикл
		
		ОбъектСправочника[ПолеЗначения.Значение] = СтруктураДанных[ПолеЗначения.Ключ];	
		
	КонецЦикла; 
	
	ОбъектСправочника.Записать();	
	
КонецПроцедуры
	
Функция НоваяТаблицаПолейЗначений() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Поле");	
	Результат.Колонки.Добавить("ИмяРеквизита");
	Результат.Колонки.Добавить("ТипСопоставления"); 
	Результат.Колонки.Добавить("Дополнительно");
	
	Возврат Результат;
	
КонецФункции  

Процедура ДобавитьСтрокуВТаблицуПолейЗначений(Таблица, Поле, ИмяРеквизита, ТипСопоставления, Дополнительно = Неопределено) Экспорт
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Поле = Поле;
	НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	НоваяСтрока.ТипСопоставления = ТипСопоставления;
	НоваяСтрока.Дополнительно = Дополнительно;  
	
КонецПроцедуры  

Функция МассивДвухЭлементов(Элемент1, Элемент2) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Элемент1);
	Результат.Добавить(Элемент2);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЖурналОтправок(Параметры, ОтветСтрокой = Ложь) Экспорт 	
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();	 
	
	Если Параметры.Свойство("ИдентификаторДокумента") Тогда 
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Параметры.ИдентификаторДокумента);
		
		СтруктураЗапроса.Вставить("docIds", МассивДокументов);
		
	КонецЕсли;
	
	Если Параметры.Свойство("НачалоПериода") Тогда
		
		СтруктураЗапроса.Вставить("dateStart", Формат(Параметры.НачалоПериода, "ДФ='гггг-ММ-дд ЧЧ:мм:сс'"));
		
	КонецЕсли;
	
	Если Параметры.Свойство("ОкончаниеПериода") Тогда
		
		СтруктураЗапроса.Вставить("dateEnd", Формат(Параметры.ОкончаниеПериода, "ДФ='гггг-ММ-дд ЧЧ:мм:сс'"));			
		
	КонецЕсли; 
	
	Если Параметры.Свойство("ПоследниеИзменения") Тогда
		
		СтруктураЗапроса.Вставить("lastupdate", Формат(Параметры.ПоследниеИзменения, "ДФ='гггг-ММ-дд ЧЧ:мм:сс'"));			
		
	КонецЕсли; 
	
	Если Параметры.Свойство("Статус") Тогда
		
		СтруктураЗапроса.Вставить("states", Параметры.Статус);
		
	КонецЕсли; 
	
	Если Параметры.Свойство("ВнутреннийНомер") Тогда
		
		СтруктураЗапроса.Вставить("orderNumber", Параметры.ВнутреннийНомер);
		
	КонецЕсли;  
	
	Если Параметры.Свойство("Откуда") Тогда
		
		СтруктураЗапроса.Вставить("derivalCity", Параметры.Откуда);
		
	КонецЕсли;
	
	Если Параметры.Свойство("Куда") Тогда
		
		СтруктураЗапроса.Вставить("arrivalCity", Параметры.Куда);
		
	КонецЕсли;
	
	Если Параметры.Свойство("Получатель") Тогда
		
		СтруктураЗапроса.Вставить("receiver", Параметры.Получатель);
		
	КонецЕсли;
	
	Если Параметры.Свойство("Отправитель") Тогда
		
		СтруктураЗапроса.Вставить("sender", Параметры.Отправитель);
		
	КонецЕсли;
	
	Если Параметры.Свойство("Страница") Тогда
		
		СтруктураЗапроса.Вставить("page", Параметры.Страница);
		ПолучитьВсеСтраницы = Ложь;
		
	КонецЕсли; 
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("СписокЗаказов"), СтруктураЗапроса);		
	
	Возврат ?(ОтветСтрокой, РезультатЗапроса.Тело, ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело));
	
КонецФункции 

Функция СтруктураЗапросаПоКлючуПриложения()
	
	Возврат Новый Структура("appKey", AppKey());
	
КонецФункции   

Функция СтруктураЗапросаПоСессии()
	
	СтруктураЗапроса = СтруктураЗапросаПоКлючуПриложения();
	СтруктураЗапроса.Вставить("sessionID", SessionID());
	
	Возврат СтруктураЗапроса;
	
КонецФункции

Функция ПолучитьРасчетКалькулятораОформитьЗаказ(СтруктураЗапроса, ИмяМетода, ФоновыйЗапуск) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, ИмяМетода, ФоновыйЗапуск);
	
КонецФункции

Функция ПолучитьОПФпоИНН(ИНН) Экспорт 
	
	Результат = Неопределено;
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();
	СтруктураЗапроса.Вставить("country", "0x8f51001438c4d49511dbd774581edb7a");
	СтруктураЗапроса.Вставить("query", ИНН); 
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ПоискКонтрагента"), СтруктураЗапроса);
	
	СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело); 
	
	Если СтруктураОтвета["data"] <> Неопределено И СтруктураОтвета["data"].Количество() > 0 Тогда
		
		Результат = СтруктураОтвета["data"][0]["opfUid"];	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  

Функция ПолучитьUIDНашегоКонтрагента() Экспорт 
	
	Результат = Неопределено;
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();	
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("СписокКонтрагентов"), СтруктураЗапроса); 
	
	СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);   
	
	Если СтруктураОтвета["data"] <> Неопределено 
		И СтруктураОтвета["data"]["counteragents"] <> Неопределено 
		И СтруктураОтвета["data"]["counteragents"].Количество() > 0 Тогда
		
		Результат = СтруктураОтвета["data"]["counteragents"][1]["uid"]; //исправить на 0
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПечатиЗаявки(ДокументИД, ИмяМетода) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("requestID", ДокументИД);
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода(ИмяМетода), СтруктураЗапроса);		
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции 

Функция ПолучитьДанныеПечатиНакладной(ТипДокумента, ДокументИД) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("docuid", ДокументИД);  
	СтруктураЗапроса.Вставить("mode", ТипДокумента);
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ПечатнаяФормаНакладной"), СтруктураЗапроса);		
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции

Функция КлючОбъектаНастроек() Экспорт
	
	Возврат "ДеловыеЛинии";
	
КонецФункции  

Функция СохранитьНастройкуСПроверкой(КлючНастройки, Данные, Сообщение = "") Экспорт
	
	НастройкаСохранена = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		
		ХранилищеОбщихНастроек.Сохранить(КлючОбъектаНастроек(), КлючНастройки, Данные);
		НастройкаСохранена = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Сообщение) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не достаточно прав для сохранения данных в хранилище настроек");
		
	КонецЕсли;
	
	Возврат НастройкаСохранена;
	
КонецФункции 

Функция РазместитьМультизаказ(НомераЗаказов) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("requestids", НомераЗаказов); 
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("Мультизаказ"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции    

Функция РазместитьПреалерт(НомераЗаказов) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("requestIDs", НомераЗаказов); 
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("Преалерт"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции   

Функция ОбновитьДанныеВодителяМашиныПреалерта(НомераПреалерта, Машина, Водитель) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("batchRequestID", НомераПреалерта);
	СтруктураЗапроса.Вставить("carNumber", Машина);
	СтруктураЗапроса.Вставить("driverName", Водитель);
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ПреалертВодительМашина"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции 

Процедура ОбновитьСправочникДЛ_Контрагенты() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("appkey", AppKey()); 
	СтруктураПараметров.Вставить("sessionID", ПараметрыСеанса.смартДЛ_ИДСессии); 
	
	СправочникСТипомЗагрузки = Новый Структура;
	СправочникСТипомЗагрузки.Вставить("Ключ", "ДЛ_Контрагенты");	
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("Справочник.ДЛ_Контрагенты"), СтруктураПараметров);
	
	Если РезультатЗапроса.КодСтатуса = 200 Тогда
		
		СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);		
			
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(СправочникСТипомЗагрузки);
		МассивПараметров.Добавить(СтруктураОтвета);
		
		ФоновыеЗадания.Выполнить("смартДеловыеЛинии.ОбновитьЗначенияСправочникаИзJSON", МассивПараметров);	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПередатьАртикулыЗаказа(НомерЗаказа, МассивАтикулов) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("orderID", НомерЗаказа);
	СтруктураЗапроса.Вставить("cargoPlaces", МассивАтикулов);	
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ПередачаАртикуловГрузовыхМест"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции 

Функция ПолучитьЭтикетки(НомерЗаказа, ФорматЭтикетки, ТипПечати) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("orderID", НомерЗаказа); 
	СтруктураЗапроса.Вставить("type", "pdf");
	СтруктураЗапроса.Вставить("format", ФорматЭтикетки);  
	СтруктураЗапроса.Вставить("oneFile", Истина);		
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода(ТипПечати), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции 

Функция ПолучитьДоступныеИзменения(НомерЗаказа) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("orderID", НомерЗаказа); 			
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ДоступныеИзменения"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции  

Функция ОтменаОтправкиДоставкиНаСервере(СтруктураЗапроса, ИмяМетода) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, ИмяМетода);
	
КонецФункции  

Функция ПриостановкаВыдачи(НомерЗаказа, ДатаПриостановки) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("orderID", НомерЗаказа); 	
	СтруктураЗапроса.Вставить("suspendDate", Формат(ДатаПриостановки, "ДФ='гггг-ММ-дд'"));
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ПриостановкаВыдачи"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции  

Функция ВозобновлениеВыдачи(НомерЗаказа, ДатаПриостановки) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("orderID", НомерЗаказа); 	
	СтруктураЗапроса.Вставить("resumeDate", Формат(ДатаПриостановки, "ДФ='гггг-ММ-дд'"));
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ВозобновлениеВыдачи"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции   

Функция  ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, ИмяМетода, ФоновыйЗапуск = Ложь)
	
	Если Не ФоновыйЗапуск Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураЗапроса, СтруктураЗапросаПоСессии());  
		
	КонецЕсли;
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода(ИмяМетода), СтруктураЗапроса);		
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);	
	
КонецФункции

Функция ИзменитьПолучателяПлательщика(СтруктураЗапроса, ИмяМетода) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, ИмяМетода);
	
КонецФункции    

Функция ИзменитьКонтактнуюИнформацию(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "ИзменитьКонтактнуюИнформацию");
	
КонецФункции 

Функция ИзменитьПараметрыЗабора(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "ИзменитьПараметрыЗабора");
	
КонецФункции 

Функция ИзменитьПараметрыДоставки(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "ИзменитьПараметрыДоставки");
	
КонецФункции

Процедура ПодрезатьРегистрЛогов() Экспорт  
	
	ДатаПодрезки = НачалоДня(ТекущаяДатаСеанса()) - 24 * 60 * 60 * смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_ДнейХраненияЛогов");
	
	ЛогЗапросов = РегистрыСведений.смартДЛ_ЛогЗапросов.СоздатьНаборЗаписей();
	ЛогЗапросов.Прочитать(); 
	
	ТЗ = ЛогЗапросов.Выгрузить();
	
	Счетчик  = 0;
	
	Пока Счетчик < ТЗ.Количество() Цикл 
		
		СтрокаТЗ = ТЗ[Счетчик];	
		
		Если СтрокаТЗ.Дата < ДатаПодрезки  Тогда  
			
			ТЗ.Удалить(СтрокаТЗ);
			
		Иначе     
			
			Счетчик = Счетчик + 1;	
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ЛогЗапросов.Количество() <> ТЗ.Количество() Тогда
		
		ЛогЗапросов.Загрузить(ТЗ);
		ЛогЗапросов.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПрочитатьДанныеГрафикаПеревозки(ДанныеГрафика, ДнейДоставкаДоПолучателя = -1, ДанныеГрафикаАвиа = Неопределено) Экспорт
	
	СписокДанных  = Новый СписокЗначений;	 	 
	
	Если ДанныеГрафика <> Неопределено Тогда
		
		ОписаниеДанных = ПолучитьОписаниеДанныхГрафикаПеревозки();
		
		ЗаполнитьСписокДанныхГрафикаПеревозки(СписокДанных, ДанныеГрафика, ОписаниеДанных);  		
		
	КонецЕсли; 
	
	Если ДанныеГрафикаАвиа <> Неопределено Тогда
		
		ОписаниеДанных = ПолучитьОписаниеДанныхГрафикаПеревозкиАвиа();
		
		ЗаполнитьСписокДанныхГрафикаПеревозки(СписокДанных, ДанныеГрафикаАвиа, ОписаниеДанных);  		
		
	КонецЕсли;	
	
	КоличествоЗаписей = СписокДанных.Количество();
	
	Если КоличествоЗаписей > 0 И ДнейДоставкаДоПолучателя >= 0 Тогда   
		
		ПоследняяЗапись = СписокДанных.Получить(КоличествоЗаписей - 1);  
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Значение",      ПоследняяЗапись.Значение.Значение + ДнейДоставкаДоПолучателя * 24 * 60 * 60);
		СтруктураДанных.Вставить("Представление", "Доставка до адреса получателя");
		
		СписокДанных.Добавить(СтруктураДанных, 8);
		
	КонецЕсли; 
	
	СписокДанных.СортироватьПоПредставлению();
	
	Возврат СписокДанных.ВыгрузитьЗначения();
	
КонецФункции  

Функция ПолучитьОписаниеДанныхГрафикаПеревозки() 
	
	ОписаниеДанныхГрафикаПеревозки = Новый Массив;		
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("pickup",                         "Забираем груз с адреса ", 1));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("arrivalToOspSender",             "Прибытие груза на терминал отправления", 2));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("declineDate",                    "Дата отклонения", 3));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("warehousing",                 	"Начало платного хранения", 5));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("arrivalToOspReceiver",      		"Прибытие груза на терминал получения", 6));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("arrivalToReceiver",         		"Доставим груз до адреса ", 8)); 
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("finish",                    		"Заказ исполнен", 9));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("arrivalToOspReceiverAccdoc",		"Прибытие сопроводительных документов на терминал получения", 11));		
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("derivalFromOspSender",           "Отправка груза с терминала отправления", 4));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("derivalFromOspReceiver",         "Отправка груза с терминала получения", 7));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("derivalFromOspReceiverAccdoc",	"Отправка сопроводительных документов с терминала получения", 10)); 	 
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("arrivalToAirport",				"Плановая дата прибытия в аэропорт", 6.1));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("arrivalToAirportMax",			"Максимальная дата прибытия в аэропорт", 6.2));
	
	Возврат ОписаниеДанныхГрафикаПеревозки;	
	
КонецФункции

Функция СтруктураОписанияГрафикаПеревозки(Поле, Представление, ПорядокВРамкахОднойДаты)
	
	Результат = Новый Структура;	
	Результат.Вставить("Поле",          Поле);
	Результат.Вставить("Представление", Представление);
	Результат.Вставить("Порядок",       ПорядокВРамкахОднойДаты);
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьЗначениеРеквизита(Ссылка, Реквизит) Экспорт 
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);  
	
КонецФункции

Функция ДоступнаНоваяВерсия() Экспорт  
	
	Результат = Новый Структура;
	Результат.Вставить("НеОповещатьОВерсии", смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДЛ_НеОповещатьОВерсии"));
	
	ПараметрыТекущейВерсии = ПолучитьПараметрыТекцущейВерсии();  
	
	Если ПараметрыТекущейВерсии.Свойство("Версия") Тогда
		
		ДДФайлаВерсий = ПолучитьДанныеОВерсияхИзФайла();
		
		Если ДДФайлаВерсий.КодСтатуса = 200 Тогда  
			
			Попытка
			
				СтруктураДанных = ДесериализоватьСтруктуруПараметров(ДДФайлаВерсий.Файл, Истина);	 
				
			Исключение 
				
				Возврат Результат;
				
			КонецПопытки;
			
			СтруктураДанныхКонфигурации = СтруктураДанных[ПараметрыТекущейВерсии.Идентификатор];
			ВерсияИзФайла = СтруктураДанныхКонфигурации["Version"];
			
			Если ВерсияИзФайла <> ПараметрыТекущейВерсии.Версия Тогда 									 
				
				Результат.Вставить("НоваяВерсия", ВерсияИзФайла);
				
				Если ЗначениеЗаполнено(СтруктураДанныхКонфигурации["Caption"]) Тогда
					
					Результат.Вставить("Описание", СтруктураДанныхКонфигурации["Caption"]);
					
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтруктураДанныхКонфигурации["Tasks"]) Тогда
					
					Результат.Вставить("МассивЗадач", СтруктураДанныхКонфигурации["Tasks"]);	
					
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтруктураДанныхКонфигурации["Url"]) Тогда
					
					Результат.Вставить("СсылкаНаФайл", СтруктураДанныхКонфигурации["Url"]);	
					
				КонецЕсли;											
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПереносШаблоновВРегистр()
	
	УстановитьПривилегированныйРежим(Истина); 	 
	
	КлючНастроек = "ШаблоныЗаказов";
	
	СписокШаблонов = ХранилищеОбщихНастроек.Загрузить(КлючОбъектаНастроек(), КлючНастроек);   	
	
	Если ТипЗнч(СписокШаблонов) = Тип("СписокЗначений") Тогда
		
		ТекущаяДата = ТекущаяДатаСеанса(); 
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Сч = 0;
		
		Для Каждого ШаблонНастроек Из СписокШаблонов Цикл			
			
			НовыйШаблон = РегистрыСведений.смартДЛ_Шаблоны.СоздатьМенеджерЗаписи();			
			НовыйШаблон.Автор = ТекущийПользователь;
			НовыйШаблон.ДатаСоздания = ТекущаяДата + Сч;
			НовыйШаблон.Наименование = ШаблонНастроек.Представление;
			НовыйШаблон.Данные        = Новый ХранилищеЗначения(ШаблонНастроек.Значение);  
			НовыйШаблон.ДатаИспользования = НовыйШаблон.ДатаСоздания;
			НовыйШаблон.Записать(Истина);
			
			Сч = Сч + 1;
			
		КонецЦикла;   
		
		ХранилищеОбщихНастроек.Удалить(КлючОбъектаНастроек(), КлючНастроек, ПользователиИнформационнойБазы.ТекущийПользователь().Имя);	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеОВерсияхИзФайла()
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения();
	
	Соединение = Новый HTTPСоединение("assets-rgw.dellin.ru",,,, НовыйИнтернетПрокси(ПараметрыПодключения.Прокси), ПараметрыПодключения.Таймаут, Новый ЗащищенноеСоединениеOpenSSL()); 	
	Запрос     = Новый HTTPЗапрос("integra-assets/uploads/1c_version_list.txt");
	//Запрос     = Новый HTTPЗапрос("integra-assets/uploads/1c_version_list_demo.txt");
	
	Ответ      = Соединение.Получить(Запрос);	
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КодСтатуса", Ответ.КодСостояния);
	СтруктураДанных.Вставить("Файл", Ответ.ПолучитьТелоКакДвоичныеДанные()); 	
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьПодсказкиПоискаАдреса(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "ПодсказкаАдреса");
	
КонецФункции

Процедура ГородаУдалитьДублиИПустыеКЛАДР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_Города.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартДЛ_Города КАК ДЛ_Города
	|ГДЕ
	|	ДЛ_Города.КодКЛАДР = """"";   
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Город = Выборка.Ссылка.ПолучитьОбъект();
		Город.Удалить();
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_Города.КодКЛАДР КАК КодКЛАДР,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТ_КЛАДР_Количество
	|ИЗ
	|	Справочник.смартДЛ_Города КАК ДЛ_Города
	|ГДЕ
	|	ДЛ_Города.КодКЛАДР = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ДЛ_Города.КодКЛАДР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КЛАДР_Количество.КодКЛАДР КАК КодКЛАДР
	|ПОМЕСТИТЬ ВТ_КЛАДР_Дубли
	|ИЗ
	|	ВТ_КЛАДР_Количество КАК ВТ_КЛАДР_Количество
	|ГДЕ
	|	ВТ_КЛАДР_Количество.Количество > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДЛ_Города.Ссылка КАК Ссылка,
	|	ДЛ_Города.КодКЛАДР КАК КодКЛАДР
	|ИЗ
	|	Справочник.смартДЛ_Города КАК ДЛ_Города
	|ГДЕ
	|	ДЛ_Города.КодКЛАДР В
	|			(ВЫБРАТЬ
	|				ВТ_КЛАДР_Дубли.КодКЛАДР
	|			ИЗ
	|				ВТ_КЛАДР_Дубли КАК ВТ_КЛАДР_Дубли)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДЛ_Города.КодКЛАДР,
	|	ДЛ_Города.ИДгорода УБЫВ"; 
	
	ТекущийКЛАДР = "";
	ЭтоПервый = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл 
		
		Если ТекущийКЛАДР <> Выборка.КодКЛАДР Тогда
			
			ТекущийКЛАДР = Выборка.КодКЛАДР;
			ЭтоПервый = Истина;	
			
		КонецЕсли; 
		
		Если ЭтоПервый Тогда 
			
			ЭтоПервый = Ложь;	
			
		Иначе	
		
			Город = Выборка.Ссылка.ПолучитьОбъект();
			Город.Удалить(); 		
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправитьМетрки(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "Метрики");
	
КонецФункции

Процедура ОчиститьОтсутсвующиеВЗагрузкеЭлементы(ИмяСправочника, ПолеПоиска, МассивЗагруженныхИД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИмяСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИмяСправочника КАК ИмяСправочника
	|ГДЕ
	|	НЕ ИмяСправочника.ПолеПоиска В (&МассивЗагруженныхИД)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяСправочника", ИмяСправочника);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолеПоиска", ПолеПоиска);
	Запрос.УстановитьПараметр("МассивЗагруженныхИД", МассивЗагруженныхИД);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.Удалить();
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьОписаниеДанныхГрафикаПеревозкиАвиа() 
	
	ОписаниеДанныхГрафикаПеревозки = Новый Массив;		
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("arrivalDate",      	"Фактическая дата прибытия груза при доставке авиатранспортом", 5.1));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("giveoutDate",      	"Дата выдачи груза при доставке авиатранспортом", 5.2));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("warehousingDate",	"Дата начала платного хранения при доставке авиатранспортом", 5.3));
	ОписаниеДанныхГрафикаПеревозки.Добавить(СтруктураОписанияГрафикаПеревозки("deliveryDate",     	"Ориентировочная дата прибытия груза при доставке авиатранспортом", 5.4));
		
	Возврат ОписаниеДанныхГрафикаПеревозки;	
	
КонецФункции

Процедура ЗаполнитьСписокДанныхГрафикаПеревозки(СписокДанных, ДанныеГрафика, ОписаниеДанных)
	
	Для Каждого ТекущееОписание Из ОписаниеДанных Цикл			
		
		ЗначениеДаты = ПреобразоватьВДату(ДанныеГрафика[ТекущееОписание.Поле]);
		
		Если ЗначениеЗаполнено(ЗначениеДаты) Тогда 				
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Значение",      ЗначениеДаты);
			СтруктураДанных.Вставить("Представление", ТекущееОписание.Представление);
			
			ПорядокСортировки = Формат(ЗначениеДаты, "ДФ=ггггММдд") + Формат(ТекущееОписание.Порядок, "ЧЦ=4; ЧДЦ=1; ЧВН=");
			СписокДанных.Добавить(СтруктураДанных, ПорядокСортировки);				 				
			
		КонецЕсли;			
		
	КонецЦикла; 
	
КонецПроцедуры		

Процедура ПодрезатьРегистрАдреснойКниги() Экспорт  
	
	ДатаПодрезки = ДобавитьМесяц(НачалоДня(ТекущаяДатаСеанса()), -2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_АдреснаяКнига.УчастникГрузоперевозки КАК УчастникГрузоперевозки,	
	|	ДЛ_АдреснаяКнига.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.смартДЛ_АдреснаяКнига КАК ДЛ_АдреснаяКнига
	|ГДЕ
	|	ДЛ_АдреснаяКнига.ДатаИспользования < &ДатаИспользования";
	Запрос.УстановитьПараметр("ДатаИспользования", ДатаПодрезки);

	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		
		НаборЗаписей = РегистрыСведений.смартДЛ_АдреснаяКнига.СоздатьНаборЗаписей();		
		НаборЗаписей.Отбор.УчастникГрузоперевозки.Установить(Выборка.УчастникГрузоперевозки);		
		НаборЗаписей.Отбор.Адрес.Установить(Выборка.Адрес);
		НаборЗаписей.Записать();  
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокКонтрагентов(ДанныеПоиска) Экспорт 
	
	Результат = Новый СписокЗначений;
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();
	СтруктураЗапроса.Вставить("country", "0x8f51001438c4d49511dbd774581edb7a");
	СтруктураЗапроса.Вставить("query", ДанныеПоиска); 
	СтруктураЗапроса.Вставить("juridical", Истина);
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ПоискКонтрагента"), СтруктураЗапроса);
	
	СтруктураОтвета = ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело); 
	
	Если СтруктураОтвета["data"] <> Неопределено И СтруктураОтвета["data"].Количество() > 0 Тогда
		
		Для Каждого ПолученныйКонтрагент Из СтруктураОтвета["data"] Цикл
			
			СтруктураКонтрагента = Новый Структура;
			СтруктураКонтрагента.Вставить("Наименование", ПолученныйКонтрагент["name"]);
			СтруктураКонтрагента.Вставить("КПП", ПолученныйКонтрагент["kpp"]); 
			СтруктураКонтрагента.Вставить("ИНН", ПолученныйКонтрагент["inn"]);			 
				
			Представление = СтруктураКонтрагента.Наименование + " ИНН " + СтруктураКонтрагента.ИНН + " КПП" + СтруктураКонтрагента.КПП; 	
			
			Результат.Добавить(СтруктураКонтрагента, Представление);	
			
		КонецЦикла;		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьСписокКонтрагентовЗаказов() Экспорт	 
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(Новый Структура("appKey, sessionID"), "КонтрагентыЗаказов");
	
КонецФункции    

Функция ПолучитьСписокГородовЗаказов() Экспорт	 
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(Новый Структура("appKey, sessionID"), "ГородаЗаказов");
	
КонецФункции

Функция ПолучитьЭтикеткиНовая(НомераЗаказов) Экспорт
	
	СтруктураЗапроса = СтруктураЗапросаПоСессии();  
	СтруктураЗапроса.Вставить("orderIDs", НомераЗаказов); 		
	
	РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресМетода("ПечатьЭтикетокНовая"), СтруктураЗапроса); 
	
	Возврат ДесериализоватьСтруктуруПараметров(РезультатЗапроса.Тело);
	
КонецФункции 

Функция ПередатьАртикулыЗаказаНовая(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "ПередачаАртикуловНовая");		
	
КонецФункции 

Функция ПолучитьПериодыВзаиморасчетов(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "ПериодыВзаиморасчётов");		
	
КонецФункции 

Функция ПолучитьВзаиморасчеты(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "Взаиморасчёты");		
	
КонецФункции 

Функция ПоискТерминалов(СтруктураЗапроса) Экспорт
	
	Возврат ОтправитьЗапросПоСессииСГотовойСтруткрой(СтруктураЗапроса, "ПоискТеминалов");		
	
КонецФункции
